### 📖 Terraform Plan (infra/resources/prod) - success
<details>
<summary>Show Plan</summary>

```hcl
  # module.apim_platform.azapi_resource.app_backend_pool will be created
  + resource "azapi_resource" "app_backend_pool" {
      + body                      = {
          + properties = {
              + description = "Load Balancer of IO Services App Backend"
              + pool        = {
                  + services = [
                      + {
                          + id = (known after apply)
                        },
                    ]
                }
              + protocol    = null
              + type        = "Pool"
              + url         = null
            }
        }
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + ignore_null_property      = false
      + location                  = (known after apply)
      + name                      = "io-services-app-backend-pool"
      + output                    = (known after apply)
      + parent_id                 = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-platform-api-gateway-apim-01"
      + schema_validation_enabled = true
      + sensitive_body            = (write-only attribute)
      + tags                      = (known after apply)
      + type                      = "Microsoft.ApiManagement/service/backends@2024-06-01-preview"
    }

  # module.apim_platform.azurerm_api_management_api.api_services_app_backend will be created
  + resource "azurerm_api_management_api" "api_services_app_backend" {
      + api_management_name   = "io-p-itn-platform-api-gateway-apim-01"
      + api_type              = (known after apply)
      + description           = "IO Services App Backend API"
      + display_name          = "IO Services App Backend"
      + id                    = (known after apply)
      + is_current            = (known after apply)
      + is_online             = (known after apply)
      + name                  = "io-services-app-backend-api"
      + path                  = "api/catalog"
      + protocols             = [
          + "https",
        ]
      + resource_group_name   = "io-p-itn-common-rg-01"
      + revision              = "1"
      + service_url           = (known after apply)
      + subscription_required = false
      + version               = "v1"
      + version_set_id        = (known after apply)

      + import {
          + content_format = "openapi-link"
          + content_value  = "https://raw.githubusercontent.com/pagopa/io-services-cms/9b841ae4b757a15214636c7d3f3b122e47b0ec7c/apps/app-backend/api/external.yaml"
        }

      + subscription_key_parameter_names (known after apply)
    }

  # module.apim_platform.azurerm_api_management_api_policy.app_backend will be created
  + resource "azurerm_api_management_api_policy" "app_backend" {
      + api_management_name = "io-p-itn-platform-api-gateway-apim-01"
      + api_name            = "io-services-app-backend-api"
      + id                  = (known after apply)
      + resource_group_name = "io-p-itn-common-rg-01"
      + xml_content         = <<-EOT
            <policies>
                <inbound>
                    <base />
                    <set-backend-service backend-id="io-services-app-backend-pool" />
                    <set-header name="x-functions-key" exists-action="override">
                        <value>{{svc-appbe-host-key}}</value>
                    </set-header>
                    <rewrite-uri template="@(context.Request.Url.Path.Replace("/catalog", ""))" />
                </inbound>
                <backend>
                    <base />
                </backend>
                <outbound>
                    <base />
                </outbound>
                <on-error>
                    <base />
                </on-error>
            </policies>
        EOT
    }

  # module.apim_platform.azurerm_api_management_api_tag.services_app_backend_api_tag will be created
  + resource "azurerm_api_management_api_tag" "services_app_backend_api_tag" {
      + api_id = (known after apply)
      + id     = (known after apply)
      + name   = "IO-Institutions"
    }

  # module.apim_platform.azurerm_api_management_api_version_set.io_services_app_backend_v1 will be created
  + resource "azurerm_api_management_api_version_set" "io_services_app_backend_v1" {
      + api_management_name = "io-p-itn-platform-api-gateway-apim-01"
      + display_name        = "IO Services App Backend v1"
      + id                  = (known after apply)
      + name                = "io_services_app_backend_v1"
      + resource_group_name = "io-p-itn-common-rg-01"
      + versioning_scheme   = "Segment"
    }

  # module.apim_platform.azurerm_api_management_backend.app_backends[0] will be created
  + resource "azurerm_api_management_backend" "app_backends" {
      + api_management_name = "io-p-itn-platform-api-gateway-apim-01"
      + id                  = (known after apply)
      + name                = "io-services-app-backend-1"
      + protocol            = "http"
      + resource_group_name = "io-p-itn-common-rg-01"
      + title               = "IO Services App Backend 1"
      + url                 = "https://io-p-itn-svc-app-be-func-01.azurewebsites.net"
    }

  # module.apim_platform.azurerm_api_management_named_value.app_backend_apim_key will be created
  + resource "azurerm_api_management_named_value" "app_backend_apim_key" {
      + api_management_name = "io-p-itn-platform-api-gateway-apim-01"
      + display_name        = "svc-appbe-host-key"
      + id                  = (known after apply)
      + name                = "svc-appbe-host-key"
      + resource_group_name = "io-p-itn-common-rg-01"
      + secret              = true
      + value               = (sensitive value)
    }

  # module.apim_platform.azurerm_api_management_product_api.app_backend will be created
  + resource "azurerm_api_management_product_api" "app_backend" {
      + api_management_name = "io-p-itn-platform-api-gateway-apim-01"
      + api_name            = "io-services-app-backend-api"
      + id                  = (known after apply)
      + product_id          = "io-institutions"
      + resource_group_name = "io-p-itn-common-rg-01"
    }

  # module.apim_platform.azurerm_api_management_tag.services_app_backend_tag will be created
  + resource "azurerm_api_management_tag" "services_app_backend_tag" {
      + api_management_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-platform-api-gateway-apim-01"
      + display_name      = (known after apply)
      + id                = (known after apply)
      + name              = "IO-Institutions"
    }

  # module.cms_function_app.module.cms_storage_account.azurerm_monitor_metric_alert.storage_account_health_check[0] will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "storage_account_health_check" {
        id                       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.Insights/metricAlerts/[iopitnsvccmsst01] Low Availability"
        name                     = "[iopitnsvccmsst01] Low Availability"
      ~ tags                     = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Enti & Servizi"
            "ModuleName"     = "azure_storage_account"
            "ModuleSource"   = "DX"
          ~ "ModuleVersion"  = "2.1.3" -> "2.1.4"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-services-cms/infra/prod/italynorth"
        }
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.cms_function_app.module.cms_storage_account.azurerm_private_endpoint.this["blob"] will be updated in-place
  ~ resource "azurerm_private_endpoint" "this" {
        id                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.Network/privateEndpoints/io-p-itn-svc-cms-blob-pep-01"
        name                          = "io-p-itn-svc-cms-blob-pep-01"
      ~ tags                          = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Enti & Servizi"
            "ModuleName"     = "azure_storage_account"
            "ModuleSource"   = "DX"
          ~ "ModuleVersion"  = "2.1.3" -> "2.1.4"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-services-cms/infra/prod/italynorth"
        }
        # (7 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.cms_function_app.module.cms_storage_account.azurerm_private_endpoint.this["queue"] will be updated in-place
  ~ resource "azurerm_private_endpoint" "this" {
        id                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.Network/privateEndpoints/io-p-itn-svc-cms-queue-pep-01"
        name                          = "io-p-itn-svc-cms-queue-pep-01"
      ~ tags                          = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Enti & Servizi"
            "ModuleName"     = "azure_storage_account"
            "ModuleSource"   = "DX"
          ~ "ModuleVersion"  = "2.1.3" -> "2.1.4"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-services-cms/infra/prod/italynorth"
        }
        # (7 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.cms_function_app.module.cms_storage_account.azurerm_storage_account.this will be updated in-place
  ~ resource "azurerm_storage_account" "this" {
        id                                 = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnsvccmsst01"
        name                               = "iopitnsvccmsst01"
      ~ tags                               = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Enti & Servizi"
            "ModuleName"     = "azure_storage_account"
            "ModuleSource"   = "DX"
          ~ "ModuleVersion"  = "2.1.3" -> "2.1.4"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-services-cms/infra/prod/italynorth"
        }
        # (97 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.cms_function_app.module.cms_storage_account.azurerm_storage_container.this["activations"] will be updated in-place
  ~ resource "azurerm_storage_container" "this" {
        id                                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnsvccmsst01/blobServices/default/containers/activations"
      ~ metadata                          = {
          ~ "moduleversion"  = "2.1.3" -> "2.1.4"
            # (8 unchanged elements hidden)
        }
        name                              = "activations"
        # (8 unchanged attributes hidden)
    }

  # module.cms_function_app.module.cms_storage_account.azurerm_storage_queue.this["request-deletion"] will be updated in-place
  ~ resource "azurerm_storage_queue" "this" {
        id                   = "https://iopitnsvccmsst01.queue.core.windows.net/request-deletion"
      ~ metadata             = {
          ~ "moduleversion"  = "2.1.3" -> "2.1.4"
            # (8 unchanged elements hidden)
        }
        name                 = "request-deletion"
        # (3 unchanged attributes hidden)
    }

  # module.cms_function_app.module.cms_storage_account.azurerm_storage_queue.this["request-deletion-poison"] will be updated in-place
  ~ resource "azurerm_storage_queue" "this" {
        id                   = "https://iopitnsvccmsst01.queue.core.windows.net/request-deletion-poison"
      ~ metadata             = {
          ~ "moduleversion"  = "2.1.3" -> "2.1.4"
            # (8 unchanged elements hidden)
        }
        name                 = "request-deletion-poison"
        # (3 unchanged attributes hidden)
    }

  # module.cms_function_app.module.cms_storage_account.azurerm_storage_queue.this["request-detail"] will be updated in-place
  ~ resource "azurerm_storage_queue" "this" {
        id                   = "https://iopitnsvccmsst01.queue.core.windows.net/request-detail"
      ~ metadata             = {
          ~ "moduleversion"  = "2.1.3" -> "2.1.4"
            # (8 unchanged elements hidden)
        }
        name                 = "request-detail"
        # (3 unchanged attributes hidden)
    }

  # module.cms_function_app.module.cms_storage_account.azurerm_storage_queue.this["request-detail-poison"] will be updated in-place
  ~ resource "azurerm_storage_queue" "this" {
        id                   = "https://iopitnsvccmsst01.queue.core.windows.net/request-detail-poison"
      ~ metadata             = {
          ~ "moduleversion"  = "2.1.3" -> "2.1.4"
            # (8 unchanged elements hidden)
        }
        name                 = "request-detail-poison"
        # (3 unchanged attributes hidden)
    }

  # module.cms_function_app.module.cms_storage_account.azurerm_storage_queue.this["request-historicization"] will be updated in-place
  ~ resource "azurerm_storage_queue" "this" {
        id                   = "https://iopitnsvccmsst01.queue.core.windows.net/request-historicization"
      ~ metadata             = {
          ~ "moduleversion"  = "2.1.3" -> "2.1.4"
            # (8 unchanged elements hidden)
        }
        name                 = "request-historicization"
        # (3 unchanged attributes hidden)
    }

  # module.cms_function_app.module.cms_storage_account.azurerm_storage_queue.this["request-historicization-poison"] will be updated in-place
  ~ resource "azurerm_storage_queue" "this" {
        id                   = "https://iopitnsvccmsst01.queue.core.windows.net/request-historicization-poison"
      ~ metadata             = {
          ~ "moduleversion"  = "2.1.3" -> "2.1.4"
            # (8 unchanged elements hidden)
        }
        name                 = "request-historicization-poison"
        # (3 unchanged attributes hidden)
    }

  # module.cms_function_app.module.cms_storage_account.azurerm_storage_queue.this["request-publication"] will be updated in-place
  ~ resource "azurerm_storage_queue" "this" {
        id                   = "https://iopitnsvccmsst01.queue.core.windows.net/request-publication"
      ~ metadata             = {
          ~ "moduleversion"  = "2.1.3" -> "2.1.4"
            # (8 unchanged elements hidden)
        }
        name                 = "request-publication"
        # (3 unchanged attributes hidden)
    }

  # module.cms_function_app.module.cms_storage_account.azurerm_storage_queue.this["request-publication-poison"] will be updated in-place
  ~ resource "azurerm_storage_queue" "this" {
        id                   = "https://iopitnsvccmsst01.queue.core.windows.net/request-publication-poison"
      ~ metadata             = {
          ~ "moduleversion"  = "2.1.3" -> "2.1.4"
            # (8 unchanged elements hidden)
        }
        name                 = "request-publication-poison"
        # (3 unchanged attributes hidden)
    }

  # module.cms_function_app.module.cms_storage_account.azurerm_storage_queue.this["request-review"] will be updated in-place
  ~ resource "azurerm_storage_queue" "this" {
        id                   = "https://iopitnsvccmsst01.queue.core.windows.net/request-review"
      ~ metadata             = {
          ~ "moduleversion"  = "2.1.3" -> "2.1.4"
            # (8 unchanged elements hidden)
        }
        name                 = "request-review"
        # (3 unchanged attributes hidden)
    }

  # module.cms_function_app.module.cms_storage_account.azurerm_storage_queue.this["request-review-legacy"] will be updated in-place
  ~ resource "azurerm_storage_queue" "this" {
        id                   = "https://iopitnsvccmsst01.queue.core.windows.net/request-review-legacy"
      ~ metadata             = {
          ~ "moduleversion"  = "2.1.3" -> "2.1.4"
            # (8 unchanged elements hidden)
        }
        name                 = "request-review-legacy"
        # (3 unchanged attributes hidden)
    }

  # module.cms_function_app.module.cms_storage_account.azurerm_storage_queue.this["request-review-legacy-poison"] will be updated in-place
  ~ resource "azurerm_storage_queue" "this" {
        id                   = "https://iopitnsvccmsst01.queue.core.windows.net/request-review-legacy-poison"
      ~ metadata             = {
          ~ "moduleversion"  = "2.1.3" -> "2.1.4"
            # (8 unchanged elements hidden)
        }
        name                 = "request-review-legacy-poison"
        # (3 unchanged attributes hidden)
    }

  # module.cms_function_app.module.cms_storage_account.azurerm_storage_queue.this["request-review-poison"] will be updated in-place
  ~ resource "azurerm_storage_queue" "this" {
        id                   = "https://iopitnsvccmsst01.queue.core.windows.net/request-review-poison"
      ~ metadata             = {
          ~ "moduleversion"  = "2.1.3" -> "2.1.4"
            # (8 unchanged elements hidden)
        }
        name                 = "request-review-poison"
        # (3 unchanged attributes hidden)
    }

  # module.cms_function_app.module.cms_storage_account.azurerm_storage_queue.this["request-services-history-ingestion-retry"] will be updated in-place
  ~ resource "azurerm_storage_queue" "this" {
        id                   = "https://iopitnsvccmsst01.queue.core.windows.net/request-services-history-ingestion-retry"
      ~ metadata             = {
          ~ "moduleversion"  = "2.1.3" -> "2.1.4"
            # (8 unchanged elements hidden)
        }
        name                 = "request-services-history-ingestion-retry"
        # (3 unchanged attributes hidden)
    }

  # module.cms_function_app.module.cms_storage_account.azurerm_storage_queue.this["request-services-history-ingestion-retry-poison"] will be updated in-place
  ~ resource "azurerm_storage_queue" "this" {
        id                   = "https://iopitnsvccmsst01.queue.core.windows.net/request-services-history-ingestion-retry-poison"
      ~ metadata             = {
          ~ "moduleversion"  = "2.1.3" -> "2.1.4"
            # (8 unchanged elements hidden)
        }
        name                 = "request-services-history-ingestion-retry-poison"
        # (3 unchanged attributes hidden)
    }

  # module.cms_function_app.module.cms_storage_account.azurerm_storage_queue.this["request-services-lifecycle-ingestion-retry"] will be updated in-place
  ~ resource "azurerm_storage_queue" "this" {
        id                   = "https://iopitnsvccmsst01.queue.core.windows.net/request-services-lifecycle-ingestion-retry"
      ~ metadata             = {
          ~ "moduleversion"  = "2.1.3" -> "2.1.4"
            # (8 unchanged elements hidden)
        }
        name                 = "request-services-lifecycle-ingestion-retry"
        # (3 unchanged attributes hidden)
    }

  # module.cms_function_app.module.cms_storage_account.azurerm_storage_queue.this["request-services-lifecycle-ingestion-retry-poison"] will be updated in-place
  ~ resource "azurerm_storage_queue" "this" {
        id                   = "https://iopitnsvccmsst01.queue.core.windows.net/request-services-lifecycle-ingestion-retry-poison"
      ~ metadata             = {
          ~ "moduleversion"  = "2.1.3" -> "2.1.4"
            # (8 unchanged elements hidden)
        }
        name                 = "request-services-lifecycle-ingestion-retry-poison"
        # (3 unchanged attributes hidden)
    }

  # module.cms_function_app.module.cms_storage_account.azurerm_storage_queue.this["request-services-publication-ingestion-retry"] will be updated in-place
  ~ resource "azurerm_storage_queue" "this" {
        id                   = "https://iopitnsvccmsst01.queue.core.windows.net/request-services-publication-ingestion-retry"
      ~ metadata             = {
          ~ "moduleversion"  = "2.1.3" -> "2.1.4"
            # (8 unchanged elements hidden)
        }
        name                 = "request-services-publication-ingestion-retry"
        # (3 unchanged attributes hidden)
    }

  # module.cms_function_app.module.cms_storage_account.azurerm_storage_queue.this["request-services-publication-ingestion-retry-poison"] will be updated in-place
  ~ resource "azurerm_storage_queue" "this" {
        id                   = "https://iopitnsvccmsst01.queue.core.windows.net/request-services-publication-ingestion-retry-poison"
      ~ metadata             = {
          ~ "moduleversion"  = "2.1.3" -> "2.1.4"
            # (8 unchanged elements hidden)
        }
        name                 = "request-services-publication-ingestion-retry-poison"
        # (3 unchanged attributes hidden)
    }

  # module.cms_function_app.module.cms_storage_account.azurerm_storage_queue.this["request-sync-cms"] will be updated in-place
  ~ resource "azurerm_storage_queue" "this" {
        id                   = "https://iopitnsvccmsst01.queue.core.windows.net/request-sync-cms"
      ~ metadata             = {
          ~ "moduleversion"  = "2.1.3" -> "2.1.4"
            # (8 unchanged elements hidden)
        }
        name                 = "request-sync-cms"
        # (3 unchanged attributes hidden)
    }

  # module.cms_function_app.module.cms_storage_account.azurerm_storage_queue.this["request-sync-cms-poison"] will be updated in-place
  ~ resource "azurerm_storage_queue" "this" {
        id                   = "https://iopitnsvccmsst01.queue.core.windows.net/request-sync-cms-poison"
      ~ metadata             = {
          ~ "moduleversion"  = "2.1.3" -> "2.1.4"
            # (8 unchanged elements hidden)
        }
        name                 = "request-sync-cms-poison"
        # (3 unchanged attributes hidden)
    }

  # module.cms_function_app.module.cms_storage_account.azurerm_storage_queue.this["request-sync-legacy"] will be updated in-place
  ~ resource "azurerm_storage_queue" "this" {
        id                   = "https://iopitnsvccmsst01.queue.core.windows.net/request-sync-legacy"
      ~ metadata             = {
          ~ "moduleversion"  = "2.1.3" -> "2.1.4"
            # (8 unchanged elements hidden)
        }
        name                 = "request-sync-legacy"
        # (3 unchanged attributes hidden)
    }

  # module.cms_function_app.module.cms_storage_account.azurerm_storage_queue.this["request-sync-legacy-poison"] will be updated in-place
  ~ resource "azurerm_storage_queue" "this" {
        id                   = "https://iopitnsvccmsst01.queue.core.windows.net/request-sync-legacy-poison"
      ~ metadata             = {
          ~ "moduleversion"  = "2.1.3" -> "2.1.4"
            # (8 unchanged elements hidden)
        }
        name                 = "request-sync-legacy-poison"
        # (3 unchanged attributes hidden)
    }

  # module.cms_function_app.module.cms_storage_account.azurerm_storage_queue.this["request-validation"] will be updated in-place
  ~ resource "azurerm_storage_queue" "this" {
        id                   = "https://iopitnsvccmsst01.queue.core.windows.net/request-validation"
      ~ metadata             = {
          ~ "moduleversion"  = "2.1.3" -> "2.1.4"
            # (8 unchanged elements hidden)
        }
        name                 = "request-validation"
        # (3 unchanged attributes hidden)
    }

  # module.cms_function_app.module.cms_storage_account.azurerm_storage_queue.this["request-validation-poison"] will be updated in-place
  ~ resource "azurerm_storage_queue" "this" {
        id                   = "https://iopitnsvccmsst01.queue.core.windows.net/request-validation-poison"
      ~ metadata             = {
          ~ "moduleversion"  = "2.1.3" -> "2.1.4"
            # (8 unchanged elements hidden)
        }
        name                 = "request-validation-poison"
        # (3 unchanged attributes hidden)
    }

  # module.cms_function_app.module.cms_storage_account.azurerm_storage_queue.this["sync-activations-from-legacy-poison"] will be updated in-place
  ~ resource "azurerm_storage_queue" "this" {
        id                   = "https://iopitnsvccmsst01.queue.core.windows.net/sync-activations-from-legacy-poison"
      ~ metadata             = {
          ~ "moduleversion"  = "2.1.3" -> "2.1.4"
            # (8 unchanged elements hidden)
        }
        name                 = "sync-activations-from-legacy-poison"
        # (3 unchanged attributes hidden)
    }

  # module.cms_function_app.module.cms_storage_account.azurerm_storage_queue.this["sync-group-poison"] will be updated in-place
  ~ resource "azurerm_storage_queue" "this" {
        id                   = "https://iopitnsvccmsst01.queue.core.windows.net/sync-group-poison"
      ~ metadata             = {
          ~ "moduleversion"  = "2.1.3" -> "2.1.4"
            # (8 unchanged elements hidden)
        }
        name                 = "sync-group-poison"
        # (3 unchanged attributes hidden)
    }

  # module.container_apps.module.backend_func_itn.azapi_resource.this[0] will be updated in-place
  ~ resource "azapi_resource" "this" {
      ~ body                      = {
          ~ properties = {
              ~ template      = {
                  ~ containers                    = [
                      ~ {
                            name      = "appbackend"
                          ~ probes    = [
                              ~ {
                                  ~ failureThreshold    = 3 -> 10
                                  ~ tcpSocket           = {
                                      - port = 80
                                    } -> null
                                    # (4 unchanged attributes hidden)
                                },
                              ~ {
                                  ~ failureThreshold    = 10 -> 3
                                  ~ httpGet             = {
                                      - httpHeaders = null
                                      - path        = "/api/v1/info"
                                      - port        = 80
                                      - scheme      = "HTTP"
                                    } -> null
                                    # (3 unchanged attributes hidden)
                                },
                            ]
                            # (3 unchanged attributes hidden)
                        },
                    ]
                    # (2 unchanged attributes hidden)
                }
                # (2 unchanged attributes hidden)
            }
        }
        id                        = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.App/containerApps/io-p-itn-svc-app-be-func-02"
        name                      = "io-p-itn-svc-app-be-func-02"
      ~ output                    = {
          - properties = {
              - configuration = {
                  - ingress = {
                      - fqdn = "io-p-itn-svc-app-be-func-02.ambitioussea-e5d71305.italynorth.azurecontainerapps.io"
                    }
                }
            }
        } -> (known after apply)
        tags                      = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Enti & Servizi"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-services-cms/infra/prod/italynorth"
        }
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.function_app.module.storage_account.azurerm_monitor_metric_alert.storage_account_health_check[0] will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "storage_account_health_check" {
        id                       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.Insights/metricAlerts/[iopitnsvcappbest01] Low Availability"
        name                     = "[iopitnsvcappbest01] Low Availability"
      ~ tags                     = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Enti & Servizi"
            "ModuleName"     = "azure_storage_account"
            "ModuleSource"   = "DX"
          ~ "ModuleVersion"  = "2.1.3" -> "2.1.4"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-services-cms/infra/prod/italynorth"
        }
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.function_app.module.storage_account.azurerm_private_endpoint.this["blob"] will be updated in-place
  ~ resource "azurerm_private_endpoint" "this" {
        id                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.Network/privateEndpoints/io-p-itn-svc-app-be-blob-pep-01"
        name                          = "io-p-itn-svc-app-be-blob-pep-01"
      ~ tags                          = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Enti & Servizi"
            "ModuleName"     = "azure_storage_account"
            "ModuleSource"   = "DX"
          ~ "ModuleVersion"  = "2.1.3" -> "2.1.4"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-services-cms/infra/prod/italynorth"
        }
        # (7 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.function_app.module.storage_account.azurerm_storage_account.this will be updated in-place
  ~ resource "azurerm_storage_account" "this" {
        id                                 = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnsvcappbest01"
        name                               = "iopitnsvcappbest01"
      ~ tags                               = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Enti & Servizi"
            "ModuleName"     = "azure_storage_account"
            "ModuleSource"   = "DX"
          ~ "ModuleVersion"  = "2.1.3" -> "2.1.4"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-services-cms/infra/prod/italynorth"
        }
        # (97 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.function_app.module.storage_account.azurerm_storage_container.this["static-content"] will be updated in-place
  ~ resource "azurerm_storage_container" "this" {
        id                                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnsvcappbest01/blobServices/default/containers/static-content"
      ~ metadata                          = {
          ~ "moduleversion"  = "2.1.3" -> "2.1.4"
            # (8 unchanged elements hidden)
        }
        name                              = "static-content"
        # (8 unchanged attributes hidden)
    }

Plan: 9 to add, 36 to change, 0 to destroy.

Warning: Deprecated attribute

  on .terraform/modules/cms_function_app.cms_storage_account/cmk.tf line 18, in resource "azurerm_key_vault_access_policy" "keys":
  18:   for_each     = (local.cmk_flags.kv && try(local.cmk_info.kv.same_subscription, false) && try(data.azurerm_key_vault.this["kv"].enable_rbac_authorization, false) == false ? toset(["kv"]) : toset([]))

The attribute "enable_rbac_authorization" is deprecated. Refer to the
provider documentation for details.

(and 3 more similar warnings elsewhere)

Warning: Argument is deprecated

  with module.cms_function_app.module.cms_storage_account.azurerm_storage_queue.this["request-detail"],
  on .terraform/modules/cms_function_app.cms_storage_account/storage_account.tf line 157, in resource "azurerm_storage_queue" "this":
 157:   storage_account_name = azurerm_storage_account.this.name

the `storage_account_name` property has been deprecated in favour of
`storage_account_id` and will be removed in version 5.0 of the Provider.

(and 4 more similar warnings elsewhere)
```

</details>
